// Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).

for (let i = 20; i <= 30; i=i+.5) { 
    alert( i )
}

// Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.

let j = 27;
let d;

for (let i = 10; i <= 100; i=i+10) {
  const d = i * j
  alert( d )
}

// Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

let n = prompt('N');
let d = '';
      
for (let i = 1; i <= 100; i++){  
  if (i*i<n){
      d = d +' '+ i; 
  }
  }
      alert( d );

//Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).

let n = prompt('N');
let a = '';
let c = 0;
let s = '';

for (let i = 1; i <= n; i++){

if (Number.isInteger (n/i)){ 
  a = a +' '+ n/i;
  c = c + 1;
} 
}

if (c===2){ 
  s = ' це просте число'
} else {
  s = ' це складене число'
}

alert(  'Число ' + n + s + '\n' +
      'Цілих дільників ' + c + ': ' + a )

// Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

let number = prompt('N');

while (number % 3 == 0) {
  number /= 3;
}
alert((number == 1)? "Число можна отримати " : "Число не можна отримати");
