let year    = prompt('Ваш рік народження');
let city    = prompt('В якому місті проживаєте');
let sport   = prompt('Ваш улюблений вид спорту');

let a;
let b;
let s;


if (isNaN(0/year) !== true)
    {a = 'Вам ' + (2023 - +year) + ' років'}
else
    {a = 'Шкода, що Ви не захотіли ввести свій вік'};
if (year === null)  
    {a = 'Шкода, що Ви не захотіли ввести свій вік'};


if (city !== '')   
    {b = 'Ви живете у місті ' + city;
    if (city ==='Київ')     {b = 'Ви живете у столиці України'}
    if (city ==='Вашингтон'){b = 'Ви живете у столиці США'}
    if (city ==='Лондон')   {b = 'Ви живете у столиці Британії'}}
else 
    {b = 'Шкода, що Ви не захотіли ввести своє місце проживання'};
if (city === null)  
    {b = 'Шкода, що Ви не захотіли ввести своє місце проживання'};

   
if (sport !== '') 
    {s = sport + ' гарний вид спорту'; 
    if (sport ==='Бокс')     {s = 'Круто! Хочеш стати як Майк Тайсон?'}
    if (sport ==='Баскетбол'){s = 'Круто! Хочеш стати як Майк Джордан?'}
    if (sport ==='Футбол')   {s = 'Круто! Хочеш стати як Криштиану Рональдо?'}}      
else
    {s = 'Шкода, що Ви не захотіли ввести свій улюблений вид спорту'};
if (sport === null) 
    {s = 'Шкода, що Ви не захотіли ввести свій улюблений вид спорту'};

    
    alert  (a + ' \n' + b + ' \n' + s); 
